In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\hp\anaconda3\envs\data science\lib\site-packages (1.0.3)
Requirement already satisfied: numpy>=1.13.3 in c:\users\hp\anaconda3\envs\data science\lib\site-packages (from pandas) (1.18.4)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\hp\anaconda3\envs\data science\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\hp\anaconda3\envs\data science\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\envs\data science\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)

In [2]:
! pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\hp\anaconda3\envs\data science\lib\site-packages (2.8.5)

In [3]:
import pandas as pd

### Let's see how to import data from CSV, API(JSON), SQL Database...etc and hold the data in a dataframe object

In [4]:
df_movies = pd.read_csv("data/IMDb movies.csv")

##### Display a few rows first using head method

In [5]:
df_movies.head()

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
1,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0
2,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,420,$ 45000,NaN,NaN,NaN,24.0,3.0
3,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2019,NaN,NaN,NaN,NaN,28.0,14.0
4,tt0002199,"From the Manger to the Cross; or, Jesus of Naz...","From the Manger to the Cross; or, Jesus of Naz...",1912,1913,"Biography, Drama",60,USA,English,Sidney Olcott,...,"R. Henderson Bland, Percy Dyer, Gene Gauntier,...","An account of the life of Jesus Christ, based ...",5.7,438,NaN,NaN,NaN,NaN,12.0,5.0

#### Get a row using loc method and pass the index of the row

In [6]:
df_movies.loc[4]

imdb_title_id                                                    tt0002199
title                    From the Manger to the Cross; or, Jesus of Naz...
original_title           From the Manger to the Cross; or, Jesus of Naz...
year                                                                  1912
date_published                                                        1913
genre                                                     Biography, Drama
duration                                                                60
country                                                                USA
language                                                           English
director                                                     Sidney Olcott
writer                                                       Gene Gauntier
production_company                                           Kalem Company
actors                   R. Henderson Bland, Percy Dyer, Gene Gauntier,...
description              An account of the life of Jesus Christ, based ...
avg_vote                                                               5.7
votes                                                                  438
budget                                                                 NaN
usa_gross_income                                                       NaN
worlwide_gross_income                                                  NaN
metascore                                                              NaN
reviews_from_users                                                      12
reviews_from_critics                                                     5
Name: 4, dtype: object

#### Import new csv creating an index this time around using column imdb_title_id

__The imdb_title_id__ will no longer be a column in our data

In [7]:
df_movies = pd.read_csv("data/IMDb movies.csv", index_col='imdb_title_id')

In [8]:
df_movies.head()

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,"Urban Gad, Gebhard Schätzler-Perasini",...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0
tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,Victorien Sardou,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,420,$ 45000,NaN,NaN,NaN,24.0,3.0
tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",Dante Alighieri,...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2019,NaN,NaN,NaN,NaN,28.0,14.0
tt0002199,"From the Manger to the Cross; or, Jesus of Naz...","From the Manger to the Cross; or, Jesus of Naz...",1912,1913,"Biography, Drama",60,USA,English,Sidney Olcott,Gene Gauntier,...,"R. Henderson Bland, Percy Dyer, Gene Gauntier,...","An account of the life of Jesus Christ, based ...",5.7,438,NaN,NaN,NaN,NaN,12.0,5.0

In [9]:
df_test = pd.read_csv("data/IMDb movies.csv")

In [10]:
df_test.head(2)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
1,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0

### Lets confirm if the imdb_title_id is really unique for every row by using the count function in pandas and storing in a set, then compare

In [11]:
x = df_test['imdb_title_id']

In [12]:
x.count() == len(set(x))

True

In [13]:
df_movies.head(2)

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,"Urban Gad, Gebhard Schätzler-Perasini",...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0

## Importing Data from a REST API (i.e JSON)

_In python we decode JSON into dictionaries_

In [14]:
df_posts = pd.read_json("https://jsonplaceholder.typicode.com/posts")

_Check if any column returns true i.e has unique values for each row_

In [15]:
df_posts['id'].count() == len(set(df_posts['id']))

True

In [16]:
df_posts.head(2)

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...

### The read_json method doesnt have the index_col arguement, we therefore use set_index

In [17]:
df_posts.set_index('id', inplace=True)

In [18]:
df_posts.head(2)

,userId,title,body
id,,,
1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
2,1,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...

In [19]:
df_movies.head(1)

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0

### Pre-requisites of EDA (Exploratory Data Analysis) i.e Descriptive statics. Data preparation/cleaning steps are;

* Run df.info() to check column/row frequencies of null/non-noll values. 
* If more than half of the rows in a column has None/NA/Null values then we could drop the column.
* If the null values are few, then we can replace them with mean/median/mode.
* Deal with duplicate values. Remove and keep only one.

### Performing Descriptive Statistics

* Also run describe() method on your df. This will show frequency/mean/min/max/standard deviation/variance of Continous values(numbers only).
* Check the relationship between continous variables i.e one column and another

In [20]:
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 81273 entries, tt0000574 to tt9914286
Data columns (total 21 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   title                  81273 non-null  object
 1   original_title         81273 non-null  object
 2   year                   81273 non-null  int64
 3   date_published         81273 non-null  object
 4   genre                  81273 non-null  object
 5   duration               81273 non-null  int64
 6   country                81234 non-null  object
 7   language               80518 non-null  object
 8   director               81200 non-null  object
 9   writer                 79780 non-null  object
 10  production_company     76948 non-null  object
 11  actors                 81207 non-null  object
 12  description            78843 non-null  object
 13  avg_vote               81273 non-null  float64
 14  votes                  81273 non-null  int64
 15  budget                 22804 non-null  object
 16  usa_gross_income       15094 non-null  object
 17  worlwide_gross_income  29892 non-null  object
 18  metascore              12722 non-null  float64
 19  reviews_from_users     74196 non-null  float64
 20  reviews_from_critics   70286 non-null  float64
dtypes: float64(4), int64(3), object(14)
memory usage: 13.6+ MB

__Country seems to have 39 null values. How would we deal with this__?

We replace the values with ameasure of tenderncy since they are few. 
In this case we choose the mode(most common country) because the data type is object (string).

_NB: IF say we needed the actors column in our objectives then we would have to remove all rows which do not have actors_

This would be the case if you are performing a qualitative analysis instead of quantitative analysis.

__Budget column has 22,804 out of 81273 (i.e almost 72%) null  values. How would we deal with scenario?__

We would drop the entire column since it contains too many null values

__How would we deal with reviews_from_users?__

We would replace the null values with the mean since the data types is integer.

### An example of creating a dataframe from an SQL Table

In [21]:
import psycopg2 as ps

In [22]:
con = ps.connect("host=localhost user=postgres password=Ewtyrr21 dbname=inventory_management_system")

In [23]:
df_sales =  pd.read_sql_query("select * from inventories",con)

In [24]:
df_sales

,id,name,type,buying_price,selling_price
0,1,Wine - Barolo Fontanafredda ...,Vegetable,66.55,60.0
1,2,Curry Paste - Madras ...,Fruit,79.05,39.6
2,3,Lettuce - Curly Endive ...,Fruit,61.78,111.6
3,4,Absolut Citron ...,Vegetable,78.42,64.8
4,5,Flower - Carnations ...,Fruit,78.98,96.0
5,6,Cheese - Cheddarsliced ...,Fruit,96.53,43.2
6,7,Cake Sheet Combo Party Pack ...,Vegetable,85.03,76.8
7,8,Cup - Paper 10oz 92959 ...,Fruit,51.18,56.4
8,9,Vanilla Beans ...,Fruit,84.54,94.8
9,10,Soupcontfoam16oz 116con ...,Fruit,81.15,96.0
10,11,"Coffee - Beans, Whole ...",Fruit,84.77,73.2
11,12,Island Oasis - Wildberry ...,Fruit,92.36,80.4
12,13,Emulsifier ...,Vegetable,88.70,9.6
13,14,Cookie Dough - Peanut Butter ...,Fruit,65.40,51.6
14,15,Wine - Duboeuf Beaujolais ...,Vegetable,76.71,102.0
15,16,Ice Cream - Strawberry ...,Fruit,97.31,26.4
16,17,Bols Melon Liqueur ...,Vegetable,61.49,24.0
17,18,Beer - Upper Canada Lager ...,Fruit,60.27,111.6
18,19,Puree - Raspberry ...,Vegetable,89.96,28.8
19,20,"Soup - Campbells, Cream Of ...",Vegetable,91.00,6.0
20,21,Beer - Upper Canada Light ...,Fruit,99.89,6.0
21,22,Island Oasis - Magarita Mix ...,Fruit,95.10,87.6
22,23,Coffee Beans - Chocolate ...,Fruit,79.04,55.2
23,24,Wine - Winzer Krems Gruner ...,Fruit,77.87,117.6
24,25,"Wine - White, Gewurtzraminer ...",Vegetable,86.10,96.0
25,26,Cookie Dough - Oatmeal Rasin ...,Vegetable,79.15,2.4
26,27,Oil - Canola ...,Vegetable,70.94,50.4
27,28,Fond - Chocolate ...,Fruit,58.81,97.2
28,29,Cheese - Stilton ...,Fruit,99.16,92.4
29,30,Island Oasis - Banana Daiquiri ...,Vegetable,99.68,85.2

In [25]:
df_sales['id'].count() == len(set(df_sales['id']))

True

In [26]:
df_sales.head(7)

,id,name,type,buying_price,selling_price
0,1,Wine - Barolo Fontanafredda ...,Vegetable,66.55,60.0
1,2,Curry Paste - Madras ...,Fruit,79.05,39.6
2,3,Lettuce - Curly Endive ...,Fruit,61.78,111.6
3,4,Absolut Citron ...,Vegetable,78.42,64.8
4,5,Flower - Carnations ...,Fruit,78.98,96.0
5,6,Cheese - Cheddarsliced ...,Fruit,96.53,43.2
6,7,Cake Sheet Combo Party Pack ...,Vegetable,85.03,76.8

### 1. Clean up our columns and check for duplicates

In [27]:
df_movies_one = pd.read_csv("data/imdb_data_1000.csv", index_col='Rank')

In [28]:
df_movies_one.columns

Index(['Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [29]:
df_movies_one.rename(columns = {'Runtime (Minutes)' : 'Runtime_Minutes',
                               'Revenue (Millions)': 'Revenue_Millions'}, 
                                 inplace=True)

In [34]:
import janitor

ModuleNotFoundError: No module named 'ConfigParser'

In [32]:
!pip install configparser

Requirement already satisfied: configparser in c:\users\hp\anaconda3\envs\data science\lib\site-packages (5.0.0)

In [ ]:
df_movies_one.rename_columns()# using janitor, you can rename the column names to the desired lower case words

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#df_movies_one.columns = [c.lower() for c in df_movies_one]
df_movies_one.str.lower()

In [ ]:
df_movies_one.columns

In [ ]:
df_movies_one.shape

In [ ]:
df_movies_one.drop_duplicates(keep='first', inplace=True)

In [ ]:
df_movies_one.shape

#### Create a temporary data frame, create duplicate values using append method

In [ ]:
tmp_df = df_movies_one.append(df_movies_one)

In [ ]:
tmp_df = tmp_df.append(df_movies_one)

In [ ]:
tmp_df.shape

In [ ]:
tmp_df_one = tmp_df.copy()

In [ ]:
tmp_df.drop_duplicates(inplace=True,keep='last')

In [ ]:
tmp_df.shape

In [ ]:
tmp_df_one.drop_duplicates(inplace=True, keep= False)

In [ ]:
tmp_df_one.shape

In [ ]:
df_movies.shape

In [ ]:
df_movies_one.shape

In [ ]:
df_comb = df_movies.append(df_movies_one)

In [ ]:
df_comb.shape

In [ ]:
df_comb.isnull().sum()

In [ ]:
df_comb.head(3)

In [ ]:
df_comb.columns

In [ ]:
df_movies.columns

In [ ]:
df_movies_one.columns

In [ ]:
df_movies_one.shape

In [ ]:
df_movies_one.isnull().sum()

In [ ]:
df_movies_one[df_movies_one.isnull().any(axis=1)]#this helps to view the specific records with null values

In [ ]:
df_movies_one = df_movies_one.fillna(df_movies_one.mean())
df_movies_one.isnull().sum()# this gives you the total sum of null values in every column

In [ ]:
df_movies_one.isnull().any()# this gives you boolean results (true or false)

In [ ]:
df_movies_one.query('index==26') #this helps to query the specific customers

In [ ]:
# Removing Null values - when the number of null values are significantly small Not recommended

In [ ]:
df_movies_clean = df_movies_one.dropna()

In [ ]:
df_movies_one1.shape

In [ ]:
df_movies_2 = df_movies_one.copy()

In [ ]:
df_movies_2.dropna(axis=1, inplace=True)

In [ ]:
df_movies_2.shape

### Alternstive solution for dropping

In [ ]:
df_movies_one2 = df_movies_one.copy()

### Remove a column with at least one null values

In [ ]:
df_movies_2.dropna(axis=0, inplace=True)

In [ ]:
df_movies_2.shape

In [ ]:
df_movies_2.shape

In [ ]:
d5 =df_movies_one.copy()

### d5['revenue_millions'].fillna(d5['revenue_millions']).mean(),inplace=True
### d5.isnull().sum()

In [ ]:
revenue  = df_movies_2['revenue_millions']

In [ ]:
rm = revenue.mean()

In [ ]:
revenue.fillna(rm, inplace=True)

In [ ]:
revenue.shape

### Find how many valaues in series have the value 'rm' as above

In [ ]:
df_movies_one2.isnull().sum()

In [ ]:
df_movies_one2.to_csv("data/imdb_1000_clean.csv")